# LinkElementId Class

---
LinkElementId represents an element in a linked document.
SystemObject Autodesk.Revit.DBLinkElementId
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class LinkElementId

    Public Class LinkElementId

    public ref class LinkElementId

    type LinkElementId = class end
The LinkElementId type exposes the following members.
| Name| Description
---|---|---
| LinkElementId(ElementId)|  Creates a new LinkElementId representing an element in the host document.
| LinkElementId(ElementId, ElementId)|  Creates a new LinkElementId representing an element in a linked document.
Top
| Name| Description
---|---|---
| HostElementId|  The id of the element in the host, or invalidElementId if there is a link.
| LinkedElementId|  The id of the element in the link, or invalidElementId if no link.
| LinkInstanceId|  The id of the link, or invalidElementId if no link.
Top
| Name| Description
---|---|---
| Equals|  Determines whether the specified Object is equal to the current Object. (Overrides ObjectEquals(Object))
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
| Name| Description
---|---|---
| Equality(LinkElementId, LinkElementId)| Determines whether these two LinkElementIds are the same.
| Inequality(LinkElementId, LinkElementId)| Determines whether these two LinkElementIds are different.
Top
The id contains two element ids:
  1. The id of the linked model element in host document.
  2. The id of the element in the linked model document.

#### Reference
Autodesk.Revit.DB Namespace